Revit 2026 API

# IFCLevelInfo Class

---

Represents information about a particular level in the document.

SystemObject Autodesk.Revit.DB.IFCIFCLevelInfo

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCLevelInfo : IDisposable
```
```vb
Public Class IFCLevelInfo
	Implements IDisposable
```
```cpp
public ref class IFCLevelInfo : IDisposable
```
```fsharp
type IFCLevelInfo =
    class
        interface IDisposable
    end
```

The IFCLevelInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DistanceToNextLevel | The distance to the next story level. |
|  | Elevation | The elevation of the level. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates an IFCLevelInfo. |
|  | Dispose | Releases all resources used by the IFCLevelInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBuildingStorey | Gets the IfcBuildingStorey handle. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLocalPlacement | Gets the local placement. |
|  | GetRelatedElements | Gets all building elements on this level. |
|  | GetRelatedProducts | Gets all building products on this level. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Level information includes the height, which is the distance to from this level to the next available level, and the actual elevation of the level, in the Revit default units.

#### Reference

Autodesk.Revit.DB.IFC Namespace